{
  "format": "layers-model",
  "generatedBy": "keras-to-tfjs",
  "convertedBy": "manual",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "batch_input_shape": [null, 28, 28, 1],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}}
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [2, 2],
            "padding": "same",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}}
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [2, 2],
            "padding": "same",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}}
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.6,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}}
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.6,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 15,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}}
          }
        }
      ]
    },
    "keras_version": "2.11.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "conv2d/kernel", "shape": [5, 5, 1, 32], "dtype": "float32"},
        {"name": "conv2d/bias", "shape": [32], "dtype": "float32"},
        {"name": "conv2d_1/kernel", "shape": [5, 5, 32, 64], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense/kernel", "shape": [1024, 512], "dtype": "float32"},
        {"name": "dense/bias", "shape": [512], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [512, 128], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [128], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [128, 15], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [15], "dtype": "float32"}
      ]
    }
  ]
}